#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: 4f761559317c51780e2b0c2bbaf65394.pdb
; shader hash: 4f761559317c51780e2b0c2bbaf65394
;
; Buffer Definitions:
;
; cbuffer g_sceneCB
; {
;
;   struct hostlayout.g_sceneCB
;   {
;
;       struct hostlayout.struct.SceneConstantBuffer
;       {
;
;           row_major float4x4 projection_to_world;   ; Offset:    0
;           float4 camera_position;                   ; Offset:   64
;           float4 light_position;                    ; Offset:   80
;           float4 light_ambient_color;               ; Offset:   96
;           float4 light_diffuse_color;               ; Offset:  112
;           float reflectance;                        ; Offset:  128
;           float elapsed_time;                       ; Offset:  132
;       
;       } g_sceneCB;                                  ; Offset:    0
;
;   
;   } g_sceneCB;                                      ; Offset:    0 Size:   136
;
; }
;
; cbuffer l_materialCB
; {
;
;   struct l_materialCB
;   {
;
;       struct struct.PrimitiveConstantBuffer
;       {
;
;           float4 albedo;                            ; Offset:    0
;           float reflectance_coefficient;            ; Offset:   16
;           float diffuse_coefficient;                ; Offset:   20
;           float specular_coefficient;               ; Offset:   24
;           float specular_power;                     ; Offset:   28

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.7.2308.16 (52da17e29)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !31, subprograms: !92, globals: !361)
!1 = !DIFile(filename: "E:\5CProjects\5CDX12ImGuiExample\5Csrc\5CRaytracing.hlsl", directory: "")
!2 = !{!3, !15, !21, !26}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Enum", scope: !5, file: !4, line: 166, size: 32, align: 32, elements: !6)
!4 = !DIFile(filename: "E:\5CProjects\5CDX12ImGuiExample\5Csrc/ConstantBuffers.h", directory: "")
!5 = !DINamespace(name: "SignedDistancePrimitive", scope: null, file: !4, line: 163)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14}
!7 = !DIEnumerator(name: "MiniSpheres", value: 0)
!8 = !DIEnumerator(name: "IntersectedRoundCube", value: 1)
!9 = !DIEnumerator(name: "SquareTorus", value: 2)
!10 = !DIEnumerator(name: "TwistedTorus", value: 3)
!11 = !DIEnumerator(name: "Cog", value: 4)
!12 = !DIEnumerator(name: "Cylinder", value: 5)
!13 = !DIEnumerator(name: "FractalPyramid", value: 6)
!14 = !DIEnumerator(name: "Count", value: 7)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Enum", scope: !16, file: !4, line: 143, size: 32, align: 32, elements: !17)
!16 = !DINamespace(name: "AnalyticPrimitive", scope: null, file: !4, line: 140)
!17 = !{!18, !19, !20}
!18 = !DIEnumerator(name: "AABB", value: 0)
!19 = !DIEnumerator(name: "Spheres", value: 1)
!20 = !DIEnumerator(name: "Count", value: 2)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Enum", scope: !22, file: !4, line: 155, size: 32, align: 32, elements: !23)
!22 = !DINamespace(name: "VolumetricPrimitive", scope: null, file: !4, line: 152)
!23 = !{!24, !25}
!24 = !DIEnumerator(name: "Metaballs", value: 0)
!25 = !DIEnumerator(name: "Count", value: 1)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Enum", scope: !27, file: !4, line: 97, size: 32, align: 32, elements: !28)
!27 = !DINamespace(name: "RayType", scope: null, file: !4, line: 94)
!28 = !{!29, !30, !20}
!29 = !DIEnumerator(name: "Radiance", value: 0)
!30 = !DIEnumerator(name: "Shadow", value: 1)
!31 = !{!32, !42, !52, !62, !46, !68, !77, !15, !21, !3}
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 151, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 151, size: 64, align: 32, elements: !34, templateParams: !38)
!34 = !{!35, !37}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !33, file: !1, line: 151, baseType: !36, size: 32, align: 32, flags: DIFlagPublic)
!36 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !33, file: !1, line: 151, baseType: !36, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !{!39, !40}
!39 = !DITemplateTypeParameter(name: "element", type: !36)
!40 = !DITemplateValueParameter(name: "element_count", type: !41, value: i32 2)
!41 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 28, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 28, size: 96, align: 32, elements: !44, templateParams: !49)
!44 = !{!45, !47, !48}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !43, file: !1, line: 28, baseType: !46, size: 32, align: 32, flags: DIFlagPublic)
!46 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !43, file: !1, line: 28, baseType: !46, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !43, file: !1, line: 28, baseType: !46, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!49 = !{!50, !51}
!50 = !DITemplateTypeParameter(name: "element", type: !46)
!51 = !DITemplateValueParameter(name: "element_count", type: !41, value: i32 3)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2x2", file: !1, line: 112, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 2, 2>", file: !1, line: 112, size: 128, align: 32, elements: !54, templateParams: !59)
!54 = !{!55, !56, !57, !58}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !53, file: !1, line: 112, baseType: !46, size: 32, align: 32, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !53, file: !1, line: 112, baseType: !46, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !53, file: !1, line: 112, baseType: !46, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !53, file: !1, line: 112, baseType: !46, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!59 = !{!50, !60, !61}
!60 = !DITemplateValueParameter(name: "row_count", type: !41, value: i32 2)
!61 = !DITemplateValueParameter(name: "col_count", type: !41, value: i32 2)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !64, templateParams: !67)
!64 = !{!65, !66}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !63, file: !1, baseType: !46, size: 32, align: 32, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !63, file: !1, baseType: !46, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!67 = !{!50, !40}
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 39, baseType: !69)
!69 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 39, size: 128, align: 32, elements: !70, templateParams: !75)
!70 = !{!71, !72, !73, !74}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !69, file: !1, line: 39, baseType: !46, size: 32, align: 32, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !69, file: !1, line: 39, baseType: !46, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !69, file: !1, line: 39, baseType: !46, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !69, file: !1, line: 39, baseType: !46, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!75 = !{!50, !76}
!76 = !DITemplateValueParameter(name: "element_count", type: !41, value: i32 4)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 285, baseType: !78)
!78 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 285, size: 288, align: 32, elements: !79, templateParams: !89)
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !78, file: !1, line: 285, baseType: !46, size: 32, align: 32, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !78, file: !1, line: 285, baseType: !46, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !78, file: !1, line: 285, baseType: !46, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !78, file: !1, line: 285, baseType: !46, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !78, file: !1, line: 285, baseType: !46, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !78, file: !1, line: 285, baseType: !46, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !78, file: !1, line: 285, baseType: !46, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !78, file: !1, line: 285, baseType: !46, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !78, file: !1, line: 285, baseType: !46, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!89 = !{!50, !90, !91}
!90 = !DITemplateValueParameter(name: "row_count", type: !41, value: i32 3)
!91 = !DITemplateValueParameter(name: "col_count", type: !41, value: i32 3)
!92 = !{!93, !97, !100, !103, !108, !112, !115, !121, !128, !131, !134, !161, !164, !167, !171, !174, !177, !186, !187, !190, !196, !199, !207, !213, !216, !220, !225, !228, !230, !231, !232, !235, !238, !239, !240, !241, !244, !245, !248, !251, !252, !255, !258, !259, !262, !263, !264, !265, !266, !269, !270, !271, !272, !273, !274, !275, !276, !279, !282, !285, !287, !291, !294, !297, !300, !303, !306, !309, !312, !315, !327, !330, !333, !340, !343, !344, !345, !346, !349}
!93 = !DISubprogram(name: "length_toPow2", linkageName: "\01?length_toPow2@@YAMV?$vector@M$01@@@Z", scope: !94, file: !94, line: 25, type: !95, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: false)
!94 = !DIFile(filename: "E:\5CProjects\5CDX12ImGuiExample\5Csrc/RaytracingShaderHelper.hlsli", directory: "")
!95 = !DISubroutineType(types: !96)
!96 = !{!46, !62}
!97 = !DISubprogram(name: "length_toPow2", linkageName: "\01?length_toPow2@@YAMV?$vector@M$02@@@Z", scope: !94, file: !94, line: 30, type: !98, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false)
!98 = !DISubroutineType(types: !99)
!99 = !{!46, !42}
!100 = !DISubprogram(name: "CalculateAnimationInterpolant", linkageName: "\01?CalculateAnimationInterpolant@@YAMMM@Z", scope: !94, file: !94, line: 36, type: !101, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false)
!101 = !DISubroutineType(types: !102)
!102 = !{!46, !46, !46}
!103 = !DISubprogram(name: "swap", linkageName: "\01?swap@@YAXAIAM0@Z", scope: !94, file: !94, line: 43, type: !104, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false)
!104 = !DISubroutineType(types: !105)
!105 = !{null, !106, !106}
!106 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !46)
!108 = !DISubprogram(name: "IsInRange", linkageName: "\01?IsInRange@@YA_NMMM@Z", scope: !94, file: !94, line: 50, type: !109, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false)
!109 = !DISubroutineType(types: !110)
!110 = !{!111, !46, !46, !46}
!111 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!112 = !DISubprogram(name: "HitWorldPosition", linkageName: "\01?HitWorldPosition@@YA?AV?$vector@M$02@@XZ", scope: !94, file: !94, line: 89, type: !113, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: false)
!113 = !DISubroutineType(types: !114)
!114 = !{!42}
!115 = !DISubprogram(name: "HitAttribute", linkageName: "\01?HitAttribute@@YA?AV?$vector@M$02@@Y02V1@V?$vector@M$01@@@Z", scope: !94, file: !94, line: 95, type: !116, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: false)
!116 = !DISubroutineType(types: !117)
!117 = !{!42, !118, !62}
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 288, align: 32, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 3)
!121 = !DISubprogram(name: "IsCulled", linkageName: "\01?IsCulled@@YA_NURay@@V?$vector@M$02@@@Z", scope: !94, file: !94, line: 123, type: !122, isLocal: false, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: false)
!122 = !DISubroutineType(types: !123)
!123 = !{!111, !124, !42}
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ray", file: !94, line: 19, size: 192, align: 32, elements: !125)
!125 = !{!126, !127}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !124, file: !94, line: 21, baseType: !42, size: 96, align: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !124, file: !94, line: 22, baseType: !42, size: 96, align: 32, offset: 96)
!128 = !DISubprogram(name: "IsAValidHit", linkageName: "\01?IsAValidHit@@YA_NURay@@MV?$vector@M$02@@@Z", scope: !94, file: !94, line: 136, type: !129, isLocal: false, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: false)
!129 = !DISubroutineType(types: !130)
!130 = !{!111, !124, !46, !42}
!131 = !DISubprogram(name: "TexCoords", linkageName: "\01?TexCoords@@YA?AV?$vector@M$01@@V?$vector@M$02@@@Z", scope: !94, file: !94, line: 142, type: !132, isLocal: false, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: false)
!132 = !DISubroutineType(types: !133)
!133 = !{!62, !42}
!134 = !DISubprogram(name: "CalculateRayDifferentials", linkageName: "\01?CalculateRayDifferentials@@YAXAIAV?$vector@M$01@@0V1@V?$vector@M$02@@22V?$matrix@M$03$03@@@Z", scope: !94, file: !94, line: 148, type: !135, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false)
!135 = !DISubroutineType(types: !136)
!136 = !{null, !137, !137, !62, !42, !42, !42, !139}
!137 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !62)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 145, baseType: !140)
!140 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 145, size: 512, align: 32, elements: !141, templateParams: !158)
!141 = !{!142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !140, file: !1, line: 145, baseType: !46, size: 32, align: 32, flags: DIFlagPublic)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !140, file: !1, line: 145, baseType: !46, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !140, file: !1, line: 145, baseType: !46, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !140, file: !1, line: 145, baseType: !46, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !140, file: !1, line: 145, baseType: !46, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !140, file: !1, line: 145, baseType: !46, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !140, file: !1, line: 145, baseType: !46, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !140, file: !1, line: 145, baseType: !46, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !140, file: !1, line: 145, baseType: !46, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !140, file: !1, line: 145, baseType: !46, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !140, file: !1, line: 145, baseType: !46, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !140, file: !1, line: 145, baseType: !46, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !140, file: !1, line: 145, baseType: !46, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !140, file: !1, line: 145, baseType: !46, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !140, file: !1, line: 145, baseType: !46, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !140, file: !1, line: 145, baseType: !46, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!158 = !{!50, !159, !160}
!159 = !DITemplateValueParameter(name: "row_count", type: !41, value: i32 4)
!160 = !DITemplateValueParameter(name: "col_count", type: !41, value: i32 4)
!161 = !DISubprogram(name: "AnalyticalCheckersTexture", linkageName: "\01?AnalyticalCheckersTexture@@YAMV?$vector@M$02@@00V?$matrix@M$03$03@@@Z", scope: !94, file: !94, line: 167, type: !162, isLocal: false, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: false)
!162 = !DISubroutineType(types: !163)
!163 = !{!46, !42, !42, !42, !139}
!164 = !DISubprogram(name: "FresnelReflectanceSchlick", linkageName: "\01?FresnelReflectanceSchlick@@YA?AV?$vector@M$02@@V1@00@Z", scope: !94, file: !94, line: 178, type: !165, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: false)
!165 = !DISubroutineType(types: !166)
!166 = !{!42, !42, !42, !42}
!167 = !DISubprogram(name: "SolveQuadraticEqn", linkageName: "\01?SolveQuadraticEqn@@YA_NMMMAIAM0@Z", scope: !168, file: !168, line: 28, type: !169, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: false)
!168 = !DIFile(filename: "E:\5CProjects\5CDX12ImGuiExample\5Csrc/AnalyticPrimitives.hlsli", directory: "")
!169 = !DISubroutineType(types: !170)
!170 = !{!111, !46, !46, !46, !106, !106}
!171 = !DISubprogram(name: "CalculateNormalForARaySphereHit", linkageName: "\01?CalculateNormalForARaySphereHit@@YA?AV?$vector@M$02@@URay@@MV1@@Z", scope: !168, file: !168, line: 46, type: !172, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false)
!172 = !DISubroutineType(types: !173)
!173 = !{!42, !124, !46, !42}
!174 = !DISubprogram(name: "SolveRaySphereIntersectionEquation", linkageName: "\01?SolveRaySphereIntersectionEquation@@YA_NURay@@AIAM1V?$vector@M$02@@M@Z", scope: !168, file: !168, line: 54, type: !175, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false)
!175 = !DISubroutineType(types: !176)
!176 = !{!111, !124, !106, !106, !42, !46}
!177 = !DISubprogram(name: "RaySphereIntersectionTest", linkageName: "\01?RaySphereIntersectionTest@@YA_NURay@@AIAM1UProceduralPrimitiveAttributes@@V?$vector@M$02@@M@Z", scope: !168, file: !168, line: 64, type: !178, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false)
!178 = !DISubroutineType(types: !179)
!179 = !{!111, !124, !106, !106, !180, !42, !46}
!180 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !181)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProceduralPrimitiveAttributes", file: !4, line: 33, size: 96, align: 32, elements: !182)
!182 = !{!183}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !181, file: !4, line: 35, baseType: !184, size: 96, align: 32)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !185, line: 4, baseType: !42)
!185 = !DIFile(filename: "E:\5CProjects\5CDX12ImGuiExample\5Csrc/HlslCompat.h", directory: "")
!186 = !DISubprogram(name: "RaySolidSphereIntersectionTest", linkageName: "\01?RaySolidSphereIntersectionTest@@YA_NURay@@AIAM1V?$vector@M$02@@M@Z", scope: !168, file: !168, line: 104, type: !175, isLocal: false, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: false)
!187 = !DISubprogram(name: "RaySpheresIntersectionTest", linkageName: "\01?RaySpheresIntersectionTest@@YA_NURay@@AIAMUProceduralPrimitiveAttributes@@@Z", scope: !168, file: !168, line: 119, type: !188, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: false)
!188 = !DISubroutineType(types: !189)
!189 = !{!111, !124, !106, !180}
!190 = !DISubprogram(name: "RayAABBIntersectionTest", linkageName: "\01?RayAABBIntersectionTest@@YA_NURay@@Y01V?$vector@M$02@@AIAM2@Z", scope: !168, file: !168, line: 158, type: !191, isLocal: false, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: false)
!191 = !DISubroutineType(types: !192)
!192 = !{!111, !124, !193, !106, !106}
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 192, align: 32, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 2)
!196 = !DISubprogram(name: "RayAABBIntersectionTest", linkageName: "\01?RayAABBIntersectionTest@@YA_NURay@@Y01V?$vector@M$02@@AIAMUProceduralPrimitiveAttributes@@@Z", scope: !168, file: !168, line: 191, type: !197, isLocal: false, isDefinition: true, scopeLine: 192, flags: DIFlagPrototyped, isOptimized: false)
!197 = !DISubroutineType(types: !198)
!198 = !{!111, !124, !193, !106, !180}
!199 = !DISubprogram(name: "CalculateMetaballPotential", linkageName: "\01?CalculateMetaballPotential@@YAMV?$vector@M$02@@UMetaball@@AIAM@Z", scope: !200, file: !200, line: 36, type: !201, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false)
!200 = !DIFile(filename: "E:\5CProjects\5CDX12ImGuiExample\5Csrc/VolumetricPrimitives.hlsli", directory: "")
!201 = !DISubroutineType(types: !202)
!202 = !{!46, !42, !203, !106}
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "Metaball", file: !200, line: 27, size: 128, align: 32, elements: !204)
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !203, file: !200, line: 29, baseType: !42, size: 96, align: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !203, file: !200, line: 30, baseType: !46, size: 32, align: 32, offset: 96)
!207 = !DISubprogram(name: "CalculateMetaballsPotential", linkageName: "\01?CalculateMetaballsPotential@@YAMV?$vector@M$02@@Y02UMetaball@@I@Z", scope: !200, file: !200, line: 60, type: !208, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: false)
!208 = !DISubroutineType(types: !209)
!209 = !{!46, !42, !210, !211}
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 384, align: 32, elements: !119)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !185, line: 8, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 57, baseType: !36)
!213 = !DISubprogram(name: "CalculateMetaballsNormal", linkageName: "\01?CalculateMetaballsNormal@@YA?AV?$vector@M$02@@V1@Y02UMetaball@@I@Z", scope: !200, file: !200, line: 76, type: !214, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false)
!214 = !DISubroutineType(types: !215)
!215 = !{!42, !42, !210, !211}
!216 = !DISubprogram(name: "InitializeAnimatedMetaballs", linkageName: "\01?InitializeAnimatedMetaballs@@YAXY02$$CAUMetaball@@MM@Z", scope: !200, file: !200, line: 88, type: !217, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !219, !46, !46}
!219 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !210)
!220 = !DISubprogram(name: "FindIntersectingMetaballs", linkageName: "\01?FindIntersectingMetaballs@@YAXURay@@AIAM1Y02$$CAUMetaball@@AIAI@Z", scope: !200, file: !200, line: 124, type: !221, isLocal: false, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: false)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !124, !106, !106, !219, !223}
!223 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !211)
!225 = !DISubprogram(name: "RayMetaballsIntersectionTest", linkageName: "\01?RayMetaballsIntersectionTest@@YA_NURay@@AIAMUProceduralPrimitiveAttributes@@M@Z", scope: !200, file: !200, line: 151, type: !226, isLocal: false, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: false)
!226 = !DISubroutineType(types: !227)
!227 = !{!111, !124, !106, !180, !46}
!228 = !DISubprogram(name: "opS", linkageName: "\01?opS@@YAMMM@Z", scope: !229, file: !229, line: 55, type: !101, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false)
!229 = !DIFile(filename: "E:\5CProjects\5CDX12ImGuiExample\5Csrc/SignedDistancePrimitives.hlsli", directory: "")
!230 = !DISubprogram(name: "opU", linkageName: "\01?opU@@YAMMM@Z", scope: !229, file: !229, line: 61, type: !101, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: false)
!231 = !DISubprogram(name: "opI", linkageName: "\01?opI@@YAMMM@Z", scope: !229, file: !229, line: 67, type: !101, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false)
!232 = !DISubprogram(name: "opRep", linkageName: "\01?opRep@@YA?AV?$vector@M$02@@V1@0@Z", scope: !229, file: !229, line: 73, type: !233, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false)
!233 = !DISubroutineType(types: !234)
!234 = !{!42, !42, !42}
!235 = !DISubprogram(name: "smin", linkageName: "\01?smin@@YAMMMM@Z", scope: !229, file: !229, line: 80, type: !236, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: false)
!236 = !DISubroutineType(types: !237)
!237 = !{!46, !46, !46, !46}
!238 = !DISubprogram(name: "smax", linkageName: "\01?smax@@YAMMMM@Z", scope: !229, file: !229, line: 88, type: !236, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false)
!239 = !DISubprogram(name: "opBlendU", linkageName: "\01?opBlendU@@YAMMM@Z", scope: !229, file: !229, line: 95, type: !101, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: false)
!240 = !DISubprogram(name: "opBlendI", linkageName: "\01?opBlendI@@YAMMM@Z", scope: !229, file: !229, line: 101, type: !101, isLocal: false, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false)
!241 = !DISubprogram(name: "opTwist", linkageName: "\01?opTwist@@YA?AV?$vector@M$02@@V1@@Z", scope: !229, file: !229, line: 108, type: !242, isLocal: false, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: false)
!242 = !DISubroutineType(types: !243)
!243 = !{!42, !42}
!244 = !DISubprogram(name: "sdPlane", linkageName: "\01?sdPlane@@YAMV?$vector@M$02@@@Z", scope: !229, file: !229, line: 119, type: !98, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: false)
!245 = !DISubprogram(name: "sdSphere", linkageName: "\01?sdSphere@@YAMV?$vector@M$02@@M@Z", scope: !229, file: !229, line: 124, type: !246, isLocal: false, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: false)
!246 = !DISubroutineType(types: !247)
!247 = !{!46, !42, !46}
!248 = !DISubprogram(name: "sdBox", linkageName: "\01?sdBox@@YAMV?$vector@M$02@@0@Z", scope: !229, file: !229, line: 130, type: !249, isLocal: false, isDefinition: true, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: false)
!249 = !DISubroutineType(types: !250)
!250 = !{!46, !42, !42}
!251 = !DISubprogram(name: "sdEllipsoid", linkageName: "\01?sdEllipsoid@@YAMV?$vector@M$02@@0@Z", scope: !229, file: !229, line: 136, type: !249, isLocal: false, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: false)
!252 = !DISubprogram(name: "udRoundBox", linkageName: "\01?udRoundBox@@YAMV?$vector@M$02@@0M@Z", scope: !229, file: !229, line: 141, type: !253, isLocal: false, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: false)
!253 = !DISubroutineType(types: !254)
!254 = !{!46, !42, !42, !46}
!255 = !DISubprogram(name: "sdTorus", linkageName: "\01?sdTorus@@YAMV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !229, file: !229, line: 147, type: !256, isLocal: false, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: false)
!256 = !DISubroutineType(types: !257)
!257 = !{!46, !42, !62}
!258 = !DISubprogram(name: "sdHexPrism", linkageName: "\01?sdHexPrism@@YAMV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !229, file: !229, line: 153, type: !256, isLocal: false, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: false)
!259 = !DISubprogram(name: "sdCapsule", linkageName: "\01?sdCapsule@@YAMV?$vector@M$02@@00M@Z", scope: !229, file: !229, line: 161, type: !260, isLocal: false, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: false)
!260 = !DISubroutineType(types: !261)
!261 = !{!46, !42, !42, !42, !46}
!262 = !DISubprogram(name: "sdEquilateralTriangle", linkageName: "\01?sdEquilateralTriangle@@YAMV?$vector@M$01@@@Z", scope: !229, file: !229, line: 168, type: !95, isLocal: false, isDefinition: true, scopeLine: 169, flags: DIFlagPrototyped, isOptimized: false)
!263 = !DISubprogram(name: "sdTriPrism", linkageName: "\01?sdTriPrism@@YAMV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !229, file: !229, line: 178, type: !256, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: false)
!264 = !DISubprogram(name: "sdCylinder", linkageName: "\01?sdCylinder@@YAMV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !229, file: !229, line: 193, type: !256, isLocal: false, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: false)
!265 = !DISubprogram(name: "sdCone", linkageName: "\01?sdCone@@YAMV?$vector@M$02@@0@Z", scope: !229, file: !229, line: 199, type: !249, isLocal: false, isDefinition: true, scopeLine: 200, flags: DIFlagPrototyped, isOptimized: false)
!266 = !DISubprogram(name: "sdConeSection", linkageName: "\01?sdConeSection@@YAMV?$vector@M$02@@MMM@Z", scope: !229, file: !229, line: 207, type: !267, isLocal: false, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: false)
!267 = !DISubroutineType(types: !268)
!268 = !{!46, !42, !46, !46, !46}
!269 = !DISubprogram(name: "sdOctahedron", linkageName: "\01?sdOctahedron@@YAMV?$vector@M$02@@0@Z", scope: !229, file: !229, line: 220, type: !249, isLocal: false, isDefinition: true, scopeLine: 221, flags: DIFlagPrototyped, isOptimized: false)
!270 = !DISubprogram(name: "sdPyramid", linkageName: "\01?sdPyramid@@YAMV?$vector@M$02@@0@Z", scope: !229, file: !229, line: 236, type: !249, isLocal: false, isDefinition: true, scopeLine: 237, flags: DIFlagPrototyped, isOptimized: false)
!271 = !DISubprogram(name: "length_toPowNegative6", linkageName: "\01?length_toPowNegative6@@YAMV?$vector@M$01@@@Z", scope: !229, file: !229, line: 245, type: !95, isLocal: false, isDefinition: true, scopeLine: 246, flags: DIFlagPrototyped, isOptimized: false)
!272 = !DISubprogram(name: "length_toPowNegative8", linkageName: "\01?length_toPowNegative8@@YAMV?$vector@M$01@@@Z", scope: !229, file: !229, line: 252, type: !95, isLocal: false, isDefinition: true, scopeLine: 253, flags: DIFlagPrototyped, isOptimized: false)
!273 = !DISubprogram(name: "sdTorus82", linkageName: "\01?sdTorus82@@YAMV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !229, file: !229, line: 258, type: !256, isLocal: false, isDefinition: true, scopeLine: 259, flags: DIFlagPrototyped, isOptimized: false)
!274 = !DISubprogram(name: "sdTorus88", linkageName: "\01?sdTorus88@@YAMV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !229, file: !229, line: 264, type: !256, isLocal: false, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: false)
!275 = !DISubprogram(name: "sdCylinder6", linkageName: "\01?sdCylinder6@@YAMV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !229, file: !229, line: 270, type: !256, isLocal: false, isDefinition: true, scopeLine: 271, flags: DIFlagPrototyped, isOptimized: false)
!276 = !DISubprogram(name: "sdCalculateNormal", linkageName: "\01?sdCalculateNormal@@YA?AV?$vector@M$02@@V1@W4Enum@SignedDistancePrimitive@@@Z", scope: !229, file: !229, line: 275, type: !277, isLocal: false, isDefinition: true, scopeLine: 276, flags: DIFlagPrototyped, isOptimized: false)
!277 = !DISubroutineType(types: !278)
!278 = !{!42, !42, !3}
!279 = !DISubprogram(name: "RaySignedDistancePrimitiveTest", linkageName: "\01?RaySignedDistancePrimitiveTest@@YA_NURay@@W4Enum@SignedDistancePrimitive@@AIAMUProceduralPrimitiveAttributes@@M@Z", scope: !229, file: !229, line: 287, type: !280, isLocal: false, isDefinition: true, scopeLine: 288, flags: DIFlagPrototyped, isOptimized: false)
!280 = !DISubroutineType(types: !281)
!281 = !{!111, !124, !3, !106, !180, !46}
!282 = !DISubprogram(name: "CheckersTextureBoxFilter", linkageName: "\01?CheckersTextureBoxFilter@@YAMV?$vector@M$01@@00I@Z", scope: !229, file: !229, line: 324, type: !283, isLocal: false, isDefinition: true, scopeLine: 325, flags: DIFlagPrototyped, isOptimized: false)
!283 = !DISubroutineType(types: !284)
!284 = !{!46, !62, !62, !62, !211}
!285 = !DISubprogram(name: "sdFractalPyramid", linkageName: "\01?sdFractalPyramid@@YAMV?$vector@M$02@@0M@Z", scope: !286, file: !286, line: 34, type: !253, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!286 = !DIFile(filename: "E:\5CProjects\5CDX12ImGuiExample\5Csrc/SignedDistanceFractals.hlsli", directory: "")
!287 = !DISubprogram(name: "RayAnalyticGeometryIntersectionTest", linkageName: "\01?RayAnalyticGeometryIntersectionTest@@YA_NURay@@W4Enum@AnalyticPrimitive@@AIAMUProceduralPrimitiveAttributes@@@Z", scope: !288, file: !288, line: 32, type: !289, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false)
!288 = !DIFile(filename: "E:\5CProjects\5CDX12ImGuiExample\5Csrc/ProceduralPrimitivesLibrary.hlsli", directory: "")
!289 = !DISubroutineType(types: !290)
!290 = !{!111, !124, !15, !106, !180}
!291 = !DISubprogram(name: "RayVolumetricGeometryIntersectionTest", linkageName: "\01?RayVolumetricGeometryIntersectionTest@@YA_NURay@@W4Enum@VolumetricPrimitive@@AIAMUProceduralPrimitiveAttributes@@M@Z", scope: !288, file: !288, line: 50, type: !292, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false)
!292 = !DISubroutineType(types: !293)
!293 = !{!111, !124, !21, !106, !180, !46}
!294 = !DISubprogram(name: "GetDistanceFromSignedDistancePrimitive", linkageName: "\01?GetDistanceFromSignedDistancePrimitive@@YAMV?$vector@M$02@@W4Enum@SignedDistancePrimitive@@@Z", scope: !288, file: !288, line: 63, type: !295, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false)
!295 = !DISubroutineType(types: !296)
!296 = !{!46, !42, !3}
!297 = !DISubprogram(name: "CalculateDiffuseCoefficient", linkageName: "\01?CalculateDiffuseCoefficient@@YAMV?$vector@M$02@@00@Z", scope: !1, file: !1, line: 35, type: !298, isLocal: false, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: false)
!298 = !DISubroutineType(types: !299)
!299 = !{!46, !42, !42, !42}
!300 = !DISubprogram(name: "CalculateSpecularCoefficient", linkageName: "\01?CalculateSpecularCoefficient@@YA?AV?$vector@M$03@@V?$vector@M$02@@00M@Z", scope: !1, file: !1, line: 42, type: !301, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false)
!301 = !DISubroutineType(types: !302)
!302 = !{!68, !42, !42, !42, !46}
!303 = !DISubprogram(name: "CalculatePhongLighting", linkageName: "\01?CalculatePhongLighting@@YA?AV?$vector@M$03@@V1@V?$vector@M$02@@_NMMM@Z", scope: !1, file: !1, line: 50, type: !304, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false)
!304 = !DISubroutineType(types: !305)
!305 = !{!68, !68, !42, !111, !46, !46, !46}
!306 = !DISubprogram(name: "TraceRadianceRay", linkageName: "\01?TraceRadianceRay@@YA?AV?$vector@M$03@@URay@@I@Z", scope: !1, file: !1, line: 87, type: !307, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false)
!307 = !DISubroutineType(types: !308)
!308 = !{!68, !124, !211}
!309 = !DISubprogram(name: "TraceShadowRayAndReportIfHit", linkageName: "\01?TraceShadowRayAndReportIfHit@@YA_NURay@@I@Z", scope: !1, file: !1, line: 115, type: !310, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: false)
!310 = !DISubroutineType(types: !311)
!311 = !{!111, !124, !211}
!312 = !DISubprogram(name: "MyRaygenShader", linkageName: "\01?MyRaygenShader@@YAXXZ", scope: !1, file: !1, line: 154, type: !313, isLocal: false, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyRaygenShader@@YAXXZ")
!313 = !DISubroutineType(types: !314)
!314 = !{null}
!315 = !DISubprogram(name: "MyClosestHitShader_Triangle", linkageName: "\01?MyClosestHitShader_Triangle@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 172, type: !316, isLocal: false, isDefinition: true, scopeLine: 173, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader_Triangle@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!316 = !DISubroutineType(types: !317)
!317 = !{null, !318, !324}
!318 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !319)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !4, line: 38, size: 160, align: 32, elements: !320)
!320 = !{!321, !323}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !319, file: !4, line: 40, baseType: !322, size: 128, align: 32)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !185, line: 5, baseType: !68)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !319, file: !4, line: 41, baseType: !211, size: 32, align: 32, offset: 128)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 165, size: 64, align: 32, elements: !325)
!325 = !{!326}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !324, file: !1, line: 165, baseType: !63, size: 64, align: 32)
!327 = !DISubprogram(name: "MyClosestHitShader_AABB", linkageName: "\01?MyClosestHitShader_AABB@@YAXURayPayload@@UProceduralPrimitiveAttributes@@@Z", scope: !1, file: !1, line: 221, type: !328, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.ProceduralPrimitiveAttributes*)* @"\01?MyClosestHitShader_AABB@@YAXURayPayload@@UProceduralPrimitiveAttributes@@@Z")
!328 = !DISubroutineType(types: !329)
!329 = !{null, !318, !181}
!330 = !DISubprogram(name: "MyMissShader", linkageName: "\01?MyMissShader@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 260, type: !331, isLocal: false, isDefinition: true, scopeLine: 261, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z")
!331 = !DISubroutineType(types: !332)
!332 = !{null, !318}
!333 = !DISubprogram(name: "MyMissShader_ShadowRay", linkageName: "\01?MyMissShader_ShadowRay@@YAXUShadowRayPayload@@@Z", scope: !1, file: !1, line: 267, type: !334, isLocal: false, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.ShadowRayPayload*)* @"\01?MyMissShader_ShadowRay@@YAXUShadowRayPayload@@@Z")
!334 = !DISubroutineType(types: !335)
!335 = !{null, !336}
!336 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !337)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "ShadowRayPayload", file: !4, line: 44, size: 32, align: 32, elements: !338)
!338 = !{!339}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !337, file: !4, line: 46, baseType: !111, size: 32, align: 32)
!340 = !DISubprogram(name: "GetRayInAABBPrimitiveLocalSpace", linkageName: "\01?GetRayInAABBPrimitiveLocalSpace@@YA?AURay@@XZ", scope: !1, file: !1, line: 277, type: !341, isLocal: false, isDefinition: true, scopeLine: 278, flags: DIFlagPrototyped, isOptimized: false)
!341 = !DISubroutineType(types: !342)
!342 = !{!124}
!343 = !DISubprogram(name: "MyIntersectionShader_AnalyticPrimitive", linkageName: "\01?MyIntersectionShader_AnalyticPrimitive@@YAXXZ", scope: !1, file: !1, line: 290, type: !313, isLocal: false, isDefinition: true, scopeLine: 291, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyIntersectionShader_AnalyticPrimitive@@YAXXZ")
!344 = !DISubprogram(name: "MyIntersectionShader_VolumetricPrimitive", linkageName: "\01?MyIntersectionShader_VolumetricPrimitive@@YAXXZ", scope: !1, file: !1, line: 308, type: !313, isLocal: false, isDefinition: true, scopeLine: 309, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyIntersectionShader_VolumetricPrimitive@@YAXXZ")
!345 = !DISubprogram(name: "MyIntersectionShader_SignedDistancePrimitive", linkageName: "\01?MyIntersectionShader_SignedDistancePrimitive@@YAXXZ", scope: !1, file: !1, line: 326, type: !313, isLocal: false, isDefinition: true, scopeLine: 327, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyIntersectionShader_SignedDistancePrimitive@@YAXXZ")
!346 = !DISubprogram(name: "GenerateCameraRay", linkageName: "\01?GenerateCameraRay@@YA?AURay@@V?$vector@I$01@@V?$vector@M$02@@V?$matrix@M$03$03@@@Z", scope: !94, file: !94, line: 103, type: !347, isLocal: false, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: false)
!347 = !DISubroutineType(types: !348)
!348 = !{!124, !32, !42, !139}
!349 = !DISubprogram(name: "Load3x16BitIndices", linkageName: "\01?Load3x16BitIndices@@YA?AV?$vector@I$02@@IUByteAddressBuffer@@@Z", scope: !94, file: !94, line: 57, type: !350, isLocal: true, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: false)
!350 = !DISubroutineType(types: !351)
!351 = !{!352, !212, !359}
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 181, baseType: !353)
!353 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 181, size: 96, align: 32, elements: !354, templateParams: !358)
!354 = !{!355, !356, !357}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !353, file: !1, line: 181, baseType: !36, size: 32, align: 32, flags: DIFlagPublic)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !353, file: !1, line: 181, baseType: !36, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !353, file: !1, line: 181, baseType: !36, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!358 = !{!39, !51}
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 21, size: 32, align: 32, elements: !360)
!360 = !{}
!361 = !{!362, !364, !365, !367, !369, !370, !371, !372, !373, !375, !376, !379, !380, !381, !382, !383, !384, !386, !387, !389, !391, !392, !393, !395, !399, !414, !415, !423, !431, !444, !452, !454, !456, !458}
!362 = !DIGlobalVariable(name: "RAY_FLAG_CULL_BACK_FACING_TRIANGLES", scope: !0, file: !1, line: 128, type: !363, isLocal: true, isDefinition: true, variable: i32 16)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!364 = !DIGlobalVariable(name: "RAY_FLAG_CULL_FRONT_FACING_TRIANGLES", scope: !0, file: !1, line: 130, type: !363, isLocal: true, isDefinition: true, variable: i32 32)
!365 = !DIGlobalVariable(name: "N", scope: !187, file: !168, line: 121, type: !366, isLocal: true, isDefinition: true)
!366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!367 = !DIGlobalVariable(name: "FLT_INFINITY", scope: !190, file: !168, line: 172, type: !368, isLocal: true, isDefinition: true)
!368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!369 = !DIGlobalVariable(name: "eps", scope: !196, file: !168, line: 208, type: !368, isLocal: true, isDefinition: true)
!370 = !DIGlobalVariable(name: "Threshold", scope: !225, file: !200, line: 185, type: !368, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariable(name: "k", scope: !262, file: !229, line: 170, type: !368, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariable(name: "threshold", scope: !279, file: !229, line: 289, type: !368, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariable(name: "MaxSteps", scope: !279, file: !229, line: 291, type: !374, isLocal: true, isDefinition: true)
!374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !211)
!375 = !DIGlobalVariable(name: "IN_SHADOW_RADIANCE", scope: !0, file: !4, line: 138, type: !368, isLocal: true, isDefinition: true, variable: float 0x3FD6666660000000)
!376 = !DIGlobalVariable(name: "GEOMETRY_STRIDE", scope: !377, file: !4, line: 118, type: !374, isLocal: true, isDefinition: true, variable: i32 2)
!377 = !DINamespace(name: "HitGroup", scope: !378, file: !4, line: 110)
!378 = !DINamespace(name: "TraceRayParameters", scope: null, file: !4, line: 106)
!379 = !DIGlobalVariable(name: "INSTANCE_MASK", scope: !378, file: !4, line: 108, type: !374, isLocal: true, isDefinition: true, variable: i32 -1)
!380 = !DIGlobalVariable(name: "RAY_FLAG_ACCEPT_FIRST_HIT_AND_END_SEARCH", scope: !0, file: !1, line: 137, type: !363, isLocal: true, isDefinition: true, variable: i32 4)
!381 = !DIGlobalVariable(name: "RAY_FLAG_FORCE_OPAQUE", scope: !0, file: !1, line: 138, type: !363, isLocal: true, isDefinition: true, variable: i32 1)
!382 = !DIGlobalVariable(name: "RAY_FLAG_SKIP_CLOSEST_HIT_SHADER", scope: !0, file: !1, line: 139, type: !363, isLocal: true, isDefinition: true, variable: i32 8)
!383 = !DIGlobalVariable(name: "INSTANCE_MASK", linkageName: "\01?INSTANCE_MASK@TraceRayParameters@@3IB", scope: !378, file: !4, line: 108, type: !374, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariable(name: "OFFSET", linkageName: "\01?OFFSET@HitGroup@TraceRayParameters@@3QBIB", scope: !377, file: !4, line: 113, type: !385, isLocal: true, isDefinition: true)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !374, size: 64, align: 32, elements: !194)
!386 = !DIGlobalVariable(name: "GEOMETRY_STRIDE", linkageName: "\01?GEOMETRY_STRIDE@HitGroup@TraceRayParameters@@3IB", scope: !377, file: !4, line: 118, type: !374, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariable(name: "OFFSET", linkageName: "\01?OFFSET@MissShader@TraceRayParameters@@3QBIB", scope: !388, file: !4, line: 125, type: !385, isLocal: true, isDefinition: true)
!388 = !DINamespace(name: "MissShader", scope: !378, file: !4, line: 122)
!389 = !DIGlobalVariable(name: "CHROMIUM_REFLECTANCE", scope: !0, file: !4, line: 135, type: !390, isLocal: true, isDefinition: true)
!390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !322)
!391 = !DIGlobalVariable(name: "BACKGROUND_COLOR", scope: !0, file: !4, line: 137, type: !390, isLocal: true, isDefinition: true)
!392 = !DIGlobalVariable(name: "IN_SHADOW_RADIANCE", scope: !0, file: !4, line: 138, type: !368, isLocal: true, isDefinition: true)
!393 = !DIGlobalVariable(name: "g_scene", linkageName: "\01?g_scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 16, type: !394, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?g_scene@@3URaytracingAccelerationStructure@@A")
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 16, size: 32, align: 32, elements: !360)
!395 = !DIGlobalVariable(name: "g_renderTarget", linkageName: "\01?g_renderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 17, type: !396, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?g_renderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!396 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 17, size: 128, align: 32, elements: !360, templateParams: !397)
!397 = !{!398}
!398 = !DITemplateTypeParameter(name: "element", type: !69)
!399 = !DIGlobalVariable(name: "g_sceneCB", linkageName: "\01?g_sceneCB@@3U?$ConstantBuffer@USceneConstantBuffer@@@@A", scope: !0, file: !1, line: 18, type: !400, isLocal: false, isDefinition: true)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<SceneConstantBuffer>", file: !1, line: 18, size: 32, align: 32, elements: !360, templateParams: !401)
!401 = !{!402}
!402 = !DITemplateTypeParameter(name: "T", type: !403)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "SceneConstantBuffer", file: !4, line: 49, size: 1088, align: 32, elements: !404)
!404 = !{!405, !407, !409, !410, !411, !412, !413}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "projection_to_world", scope: !403, file: !4, line: 51, baseType: !406, size: 512, align: 32)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMMATRIX", file: !185, line: 7, baseType: !139)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "camera_position", scope: !403, file: !4, line: 52, baseType: !408, size: 128, align: 32, offset: 512)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMVECTOR", file: !185, line: 6, baseType: !68)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "light_position", scope: !403, file: !4, line: 53, baseType: !408, size: 128, align: 32, offset: 640)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "light_ambient_color", scope: !403, file: !4, line: 54, baseType: !408, size: 128, align: 32, offset: 768)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "light_diffuse_color", scope: !403, file: !4, line: 55, baseType: !408, size: 128, align: 32, offset: 896)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "reflectance", scope: !403, file: !4, line: 56, baseType: !46, size: 32, align: 32, offset: 1024)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed_time", scope: !403, file: !4, line: 57, baseType: !46, size: 32, align: 32, offset: 1056)
!414 = !DIGlobalVariable(name: "g_indices", linkageName: "\01?g_indices@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 21, type: !359, isLocal: false, isDefinition: true, variable: %struct.ByteAddressBuffer* @"\01?g_indices@@3UByteAddressBuffer@@A")
!415 = !DIGlobalVariable(name: "g_vertices", linkageName: "\01?g_vertices@@3V?$StructuredBuffer@UVertex@@@@A", scope: !0, file: !1, line: 22, type: !416, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<Vertex>"* @"\01?g_vertices@@3V?$StructuredBuffer@UVertex@@@@A")
!416 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Vertex>", file: !1, line: 22, size: 192, align: 32, elements: !360, templateParams: !417)
!417 = !{!418}
!418 = !DITemplateTypeParameter(name: "element", type: !419)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vertex", file: !4, line: 87, size: 192, align: 32, elements: !420)
!420 = !{!421, !422}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !419, file: !4, line: 89, baseType: !184, size: 96, align: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !419, file: !4, line: 90, baseType: !184, size: 96, align: 32, offset: 96)
!423 = !DIGlobalVariable(name: "g_AABBPrimitiveAttributes", linkageName: "\01?g_AABBPrimitiveAttributes@@3V?$StructuredBuffer@UPrimitiveInstancePerFrameBuffer@@@@A", scope: !0, file: !1, line: 25, type: !424, isLocal: false, isDefinition: true)
!424 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<PrimitiveInstancePerFrameBuffer>", file: !1, line: 25, size: 1024, align: 32, elements: !360, templateParams: !425)
!425 = !{!426}
!426 = !DITemplateTypeParameter(name: "element", type: !427)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrimitiveInstancePerFrameBuffer", file: !4, line: 81, size: 1024, align: 32, elements: !428)
!428 = !{!429, !430}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "local_space_to_bottom_level_as", scope: !427, file: !4, line: 83, baseType: !406, size: 512, align: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_level_as_to_local_space", scope: !427, file: !4, line: 84, baseType: !406, size: 512, align: 32, offset: 512)
!431 = !DIGlobalVariable(name: "l_materialCB", linkageName: "\01?l_materialCB@@3U?$ConstantBuffer@UPrimitiveConstantBuffer@@@@A", scope: !0, file: !1, line: 26, type: !432, isLocal: false, isDefinition: true)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<PrimitiveConstantBuffer>", file: !1, line: 26, size: 32, align: 32, elements: !360, templateParams: !433)
!433 = !{!434}
!434 = !DITemplateTypeParameter(name: "T", type: !435)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrimitiveConstantBuffer", file: !4, line: 61, size: 384, align: 32, elements: !436)
!436 = !{!437, !438, !439, !440, !441, !442, !443}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "albedo", scope: !435, file: !4, line: 63, baseType: !322, size: 128, align: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "reflectance_coefficient", scope: !435, file: !4, line: 64, baseType: !46, size: 32, align: 32, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "diffuse_coefficient", scope: !435, file: !4, line: 65, baseType: !46, size: 32, align: 32, offset: 160)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "specular_coefficient", scope: !435, file: !4, line: 66, baseType: !46, size: 32, align: 32, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "specular_power", scope: !435, file: !4, line: 67, baseType: !46, size: 32, align: 32, offset: 224)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "step_scale", scope: !435, file: !4, line: 68, baseType: !46, size: 32, align: 32, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !435, file: !4, line: 70, baseType: !184, size: 96, align: 32, offset: 288)
!444 = !DIGlobalVariable(name: "l_aabbCB", linkageName: "\01?l_aabbCB@@3U?$ConstantBuffer@UPrimitiveInstanceConstantBuffer@@@@A", scope: !0, file: !1, line: 27, type: !445, isLocal: false, isDefinition: true)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<PrimitiveInstanceConstantBuffer>", file: !1, line: 27, size: 32, align: 32, elements: !360, templateParams: !446)
!446 = !{!447}
!447 = !DITemplateTypeParameter(name: "T", type: !448)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrimitiveInstanceConstantBuffer", file: !4, line: 74, size: 64, align: 32, elements: !449)
!449 = !{!450, !451}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "instance_index", scope: !448, file: !4, line: 76, baseType: !211, size: 32, align: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "primitive_type", scope: !448, file: !4, line: 77, baseType: !211, size: 32, align: 32, offset: 32)
!452 = !DIGlobalVariable(name: "BACKGROUND_COLOR.2", linkageName: "BACKGROUND_COLOR.2", scope: !0, file: !4, line: 137, type: !453, isLocal: false, isDefinition: true)
!453 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !390, size: 32, align: 4, offset: 64)
!454 = !DIGlobalVariable(name: "BACKGROUND_COLOR.3", linkageName: "BACKGROUND_COLOR.3", scope: !0, file: !4, line: 137, type: !455, isLocal: false, isDefinition: true)
!455 = !DIDerivedType(tag: DW_TAG_member, name: ".3", baseType: !390, size: 32, align: 4, offset: 96)
!456 = !DIGlobalVariable(name: "BACKGROUND_COLOR.1", linkageName: "BACKGROUND_COLOR.1", scope: !0, file: !4, line: 137, type: !457, isLocal: false, isDefinition: true)
!457 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !390, size: 32, align: 4, offset: 32)
!458 = !DIGlobalVariable(name: "BACKGROUND_COLOR.0", linkageName: "BACKGROUND_COLOR.0", scope: !0, file: !4, line: 137, type: !459, isLocal: false, isDefinition: true)
!459 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !390, size: 32, align: 4)
!460 = !{i32 2, !"Dwarf Version", i32 4}
!461 = !{i32 2, !"Debug Info Version", i32 3}
!462 = !{!"dxcoob 1.7.2308.16 (52da17e29)"}
!463 = !{!"E:\5CProjects\5CDX12ImGuiExample\5Csrc\5CRaytracing.hlsl", !"#ifndef RAYTRACING_HLSL\0D\0A#define RAYTRACING_HLSL\0D\0A\0D\0A#define HLSL\0D\0A#include \22ConstantBuffers.h\22\0D\0A#include \22ProceduralPrimitivesLibrary.hlsli\22\0D\0A#include \22RaytracingShaderHelper.hlsli\22\0D\0A\0D\0A//***************************************************************************\0D\0A//*****------ Shader resources bound via root signatures -------*************\0D\0A//***************************************************************************\0D\0A\0D\0A// Scene wide resources.\0D\0A//  g_* - bound via a global root signature.\0D\0A//  l_* - bound via a local root signature.\0D\0ARaytracingAccelerationStructure g_scene : register(t0, space0);\0D\0ARWTexture2D<float4> g_renderTarget : register(u0);\0D\0AConstantBuffer<SceneConstantBuffer> g_sceneCB : register(b0);\0D\0A\0D\0A// Triangle resources\0D\0AByteAddressBuffer g_indices : register(t1, space0);\0D\0AStructuredBuffer<Vertex> g_vertices : register(t2, space0);\0D\0A\0D\0A// Procedural geometry resources\0D\0AStructuredBuffer<PrimitiveInstancePerFrameBuffer> g_AABBPrimitiveAttributes : register(t3, space0);\0D\0AConstantBuffer<PrimitiveConstantBuffer> l_materialCB : register(b1);\0D\0AConstantBuffer<PrimitiveInstanceConstantBuffer> l_aabbCB: register(b2);\0D\0A\0D\0A\0D\0A//***************************************************************************\0D\0A//****************------ Utility functions -------***************************\0D\0A//***************************************************************************\0D\0A\0D\0A// Diffuse lighting calculation.\0D\0Afloat CalculateDiffuseCoefficient(in float3 hitPosition, in float3 incidentLightRay, in float3 normal)\0D\0A{\0D\0A    float fNDotL = saturate(dot(-incidentLightRay, normal));\0D\0A    return fNDotL;\0D\0A}\0D\0A\0D\0A// Phong lighting specular component\0D\0Afloat4 CalculateSpecularCoefficient(in float3 hitPosition, in float3 incidentLightRay, in float3 normal, in float specularPower)\0D\0A{\0D\0A    float3 reflectedLightRay = normalize(reflect(incidentLightRay, normal));\0D\0A    return pow(saturate(dot(reflectedLightRay, normalize (-WorldRayDirection()))), specularPower);\0D\0A}\0D\0A\0D\0A\0D\0A// Phong lighting model = ambient + diffuse + specular components.\0D\0Afloat4 CalculatePhongLighting(in float4 albedo, in float3 normal, in bool isInShadow, in float diffuseCoef = 1.0, in float specularCoef = 1.0, in float specularPower = 50)\0D\0A{\0D\0A    float3 hitPosition = HitWorldPosition();\0D\0A    float3 lightPosition = g_sceneCB.light_position.xyz;\0D\0A    float shadowFactor = isInShadow ? IN_SHADOW_RADIANCE : 1.0;\0D\0A    float3 incidentLightRay = normalize(hitPosition - lightPosition);\0D\0A\0D\0A    // Diffuse component.\0D\0A    float4 lightDiffuseColor = g_sceneCB.light_diffuse_color;\0D\0A    float Kd = CalculateDiffuseCoefficient(hitPosition, incidentLightRay, normal);\0D\0A    float4 diffuseColor = shadowFactor * diffuseCoef * Kd * lightDiffuseColor * albedo;\0D\0A\0D\0A    // Specular component.\0D\0A    float4 specularColor = float4(0, 0, 0, 0);\0D\0A    if (!isInShadow)\0D\0A    {\0D\0A        float4 lightSpecularColor = float4(1, 1, 1, 1);\0D\0A        float4 Ks = CalculateSpecularCoefficient(hitPosition, incidentLightRay, normal, specularPower);\0D\0A        specularColor = specularCoef * Ks * lightSpecularColor;\0D\0A    }\0D\0A\0D\0A    // Ambient component.\0D\0A    // Fake AO: Darken faces with normal facing downwards/away from the sky a little bit.\0D\0A    float4 ambientColor = g_sceneCB.light_ambient_color;\0D\0A    float4 ambientColorMin = g_sceneCB.light_ambient_color - 0.1;\0D\0A    float4 ambientColorMax = g_sceneCB.light_ambient_color;\0D\0A    float a = 1 - saturate(dot(normal, float3(0, -1, 0)));\0D\0A    ambientColor = albedo * lerp(ambientColorMin, ambientColorMax, a);\0D\0A\0D\0A    return ambientColor + diffuseColor + specularColor;\0D\0A}\0D\0A\0D\0A//***************************************************************************\0D\0A//*****------ TraceRay wrappers for radiance and shadow rays. -------********\0D\0A//***************************************************************************\0D\0A\0D\0A// Trace a radiance ray into the scene and returns a shaded color.\0D\0Afloat4 TraceRadianceRay(in Ray ray, in UINT currentRayRecursionDepth)\0D\0A{\0D\0A    if (currentRayRecursionDepth >= MAX_RAY_RECURSION_DEPTH)\0D\0A    {\0D\0A        return float4(0, 0, 0, 0);\0D\0A    }\0D\0A\0D\0A    // Set the ray's extents.\0D\0A    RayDesc rayDesc;\0D\0A    rayDesc.Origin = ray.origin;\0D\0A    rayDesc.Direction = ray.direction;\0D\0A    // Set TMin to a zero value to avoid aliasing artifacts along contact areas.\0D\0A    // Note: make sure to enable face culling so as to avoid surface face fighting.\0D\0A    rayDesc.TMin = 0;\0D\0A    rayDesc.TMax = 10000;\0D\0A    RayPayload rayPayload = { float4(0, 0, 0, 0), currentRayRecursionDepth + 1 };\0D\0A    TraceRay(g_scene,\0D\0A        RAY_FLAG_CULL_BACK_FACING_TRIANGLES,\0D\0A        TraceRayParameters::INSTANCE_MASK,\0D\0A        TraceRayParameters::HitGroup::OFFSET[RayType::Radiance],\0D\0A        TraceRayParameters::HitGroup::GEOMETRY_STRIDE,\0D\0A        TraceRayParameters::MissShader::OFFSET[RayType::Radiance],\0D\0A        rayDesc, rayPayload);\0D\0A\0D\0A    return rayPayload.color;\0D\0A}\0D\0A\0D\0A// Trace a shadow ray and return true if it hits any geometry.\0D\0Abool TraceShadowRayAndReportIfHit(in Ray ray, in UINT currentRayRecursionDepth)\0D\0A{\0D\0A    if (currentRayRecursionDepth >= MAX_RAY_RECURSION_DEPTH)\0D\0A    {\0D\0A        return false;\0D\0A    }\0D\0A\0D\0A    // Set the ray's extents.\0D\0A    RayDesc rayDesc;\0D\0A    rayDesc.Origin = ray.origin;\0D\0A    rayDesc.Direction = ray.direction;\0D\0A    // Set TMin to a zero value to avoid aliasing artifcats along contact areas.\0D\0A    // Note: make sure to enable back-face culling so as to avoid surface face fighting.\0D\0A    rayDesc.TMin = 0;\0D\0A    rayDesc.TMax = 10000;\0D\0A\0D\0A    // Initialize shadow ray payload.\0D\0A    // Set the initial value to true since closest and any hit shaders are skipped.\0D\0A    // Shadow miss shader, if called, will set it to false.\0D\0A    ShadowRayPayload shadowPayload = { true };\0D\0A    TraceRay(g_scene,\0D\0A        RAY_FLAG_CULL_BACK_FACING_TRIANGLES\0D\0A        | RAY_FLAG_ACCEPT_FIRST_HIT_AND_END_SEARCH\0D\0A        | RAY_FLAG_FORCE_OPAQUE             // ~skip any hit shaders\0D\0A        | RAY_FLAG_SKIP_CLOSEST_HIT_SHADER, // ~skip closest hit shaders,\0D\0A        TraceRayParameters::INSTANCE_MASK,\0D\0A        TraceRayParameters::HitGroup::OFFSET[RayType::Shadow],\0D\0A        TraceRayParameters::HitGroup::GEOMETRY_STRIDE,\0D\0A        TraceRayParameters::MissShader::OFFSET[RayType::Shadow],\0D\0A        rayDesc, shadowPayload);\0D\0A\0D\0A    return shadowPayload.hit;\0D\0A}\0D\0A\0D\0A//***************************************************************************\0D\0A//********************------ Ray gen shader.. -------************************\0D\0A//***************************************************************************\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid MyRaygenShader()\0D\0A{\0D\0A    // Generate a ray for a camera pixel corresponding to an index from the dispatched 2D grid.\0D\0A    Ray ray = GenerateCameraRay(DispatchRaysIndex().xy, g_sceneCB.camera_position.xyz, g_sceneCB.projection_to_world);\0D\0A\0D\0A    // Cast a ray into the scene and retrieve a shaded color.\0D\0A    UINT currentRecursionDepth = 0;\0D\0A    float4 color = TraceRadianceRay(ray, currentRecursionDepth);\0D\0A\0D\0A    // Write the raytraced color to the output texture.\0D\0A    g_renderTarget[DispatchRaysIndex().xy] = color;\0D\0A}\0D\0A\0D\0A//***************************************************************************\0D\0A//******************------ Closest hit shaders -------***********************\0D\0A//***************************************************************************\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid MyClosestHitShader_Triangle(inout RayPayload rayPayload, in BuiltInTriangleIntersectionAttributes attr)\0D\0A{\0D\0A    // Get the base index of the triangle's first 16 bit index.\0D\0A    uint indexSizeInBytes = 2;\0D\0A    uint indicesPerTriangle = 3;\0D\0A    uint triangleIndexStride = indicesPerTriangle * indexSizeInBytes;\0D\0A    uint baseIndex = PrimitiveIndex() * triangleIndexStride;\0D\0A\0D\0A    // Load up three 16 bit indices for the triangle.\0D\0A    const uint3 indices = Load3x16BitIndices(baseIndex, g_indices);\0D\0A\0D\0A    // Retrieve corresponding vertex normals for the triangle vertices.\0D\0A    float3 triangleNormal = g_vertices[indices[0]].normal;\0D\0A\0D\0A    // PERFORMANCE TIP: it is recommended to avoid values carry over across TraceRay() calls.\0D\0A    // Therefore, in cases like retrieving HitWorldPosition(), it is recomputed every time.\0D\0A\0D\0A    // Shadow component.\0D\0A    // Trace a shadow ray.\0D\0A    float3 hitPosition = HitWorldPosition();\0D\0A    Ray shadowRay = { hitPosition, normalize(g_sceneCB.light_position.xyz - hitPosition) };\0D\0A    bool shadowRayHit = TraceShadowRayAndReportIfHit(shadowRay, rayPayload.recursion_depth);\0D\0A\0D\0A    float checkers = AnalyticalCheckersTexture(HitWorldPosition(), triangleNormal, g_sceneCB.camera_position.xyz, g_sceneCB.projection_to_world);\0D\0A\0D\0A    // Reflected component.\0D\0A    float4 reflectedColor = float4(0, 0, 0, 0);\0D\0A    if (l_materialCB.reflectance_coefficient > 0.001 )\0D\0A    {\0D\0A        // Trace a reflection ray.\0D\0A        Ray reflectionRay = { HitWorldPosition(), reflect(WorldRayDirection(), triangleNormal) };\0D\0A        float4 reflectionColor = TraceRadianceRay(reflectionRay, rayPayload.recursion_depth);\0D\0A\0D\0A        float3 fresnelR = FresnelReflectanceSchlick(WorldRayDirection(), triangleNormal, l_materialCB.albedo.xyz);\0D\0A        reflectedColor = l_materialCB.reflectance_coefficient * float4(fresnelR, 1) * reflectionColor;\0D\0A    }\0D\0A\0D\0A    // Calculate final color.\0D\0A    float4 phongColor = CalculatePhongLighting(l_materialCB.albedo, triangleNormal, shadowRayHit, l_materialCB.diffuse_coefficient, l_materialCB.specular_coefficient, l_materialCB.specular_power);\0D\0A    float4 color = checkers * (phongColor + reflectedColor);\0D\0A\0D\0A    // Apply visibility falloff.\0D\0A    float t = RayTCurrent();\0D\0A    color = lerp(color, BACKGROUND_COLOR, 1.0 - exp(-0.000002*t*t*t));\0D\0A\0D\0A    rayPayload.color = color;\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid MyClosestHitShader_AABB(inout RayPayload rayPayload, in ProceduralPrimitiveAttributes attr)\0D\0A{\0D\0A    // PERFORMANCE TIP: it is recommended to minimize values carry over across TraceRay() calls. \0D\0A    // Therefore, in cases like retrieving HitWorldPosition(), it is recomputed every time.\0D\0A\0D\0A    // Shadow component.\0D\0A    // Trace a shadow ray.\0D\0A    float3 hitPosition = HitWorldPosition();\0D\0A    Ray shadowRay = { hitPosition, normalize(g_sceneCB.light_position.xyz - hitPosition) };\0D\0A    bool shadowRayHit = TraceShadowRayAndReportIfHit(shadowRay, rayPayload.recursion_depth);\0D\0A\0D\0A    // Reflected component.\0D\0A    float4 reflectedColor = float4(0, 0, 0, 0);\0D\0A    if (l_materialCB.reflectance_coefficient > 0.001)\0D\0A    {\0D\0A        // Trace a reflection ray.\0D\0A        Ray reflectionRay = { HitWorldPosition(), reflect(WorldRayDirection(), attr.normal) };\0D\0A        float4 reflectionColor = TraceRadianceRay(reflectionRay, rayPayload.recursion_depth);\0D\0A\0D\0A        float3 fresnelR = FresnelReflectanceSchlick(WorldRayDirection(), attr.normal, l_materialCB.albedo.xyz);\0D\0A        reflectedColor = l_materialCB.reflectance_coefficient * float4(fresnelR, 1) * reflectionColor;\0D\0A    }\0D\0A\0D\0A    // Calculate final color.\0D\0A    float4 phongColor = CalculatePhongLighting(l_materialCB.albedo, attr.normal, shadowRayHit, l_materialCB.diffuse_coefficient, l_materialCB.specular_coefficient, l_materialCB.specular_power);\0D\0A    float4 color = phongColor + reflectedColor;\0D\0A\0D\0A    // Apply visibility falloff.\0D\0A    float t = RayTCurrent();\0D\0A    color = lerp(color, BACKGROUND_COLOR, 1.0 - exp(-0.000002*t*t*t));\0D\0A\0D\0A    rayPayload.color = color;\0D\0A}\0D\0A\0D\0A//***************************************************************************\0D\0A//**********************------ Miss shaders -------**************************\0D\0A//***************************************************************************\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid MyMissShader(inout RayPayload rayPayload)\0D\0A{\0D\0A    float4 backgroundColor = float4(BACKGROUND_COLOR);\0D\0A    rayPayload.color = backgroundColor;\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid MyMissShader_ShadowRay(inout ShadowRayPayload rayPayload)\0D\0A{\0D\0A    rayPayload.hit = false;\0D\0A}\0D\0A\0D\0A//***************************************************************************\0D\0A//*****************------ Intersection shaders-------************************\0D\0A//***************************************************************************\0D\0A\0D\0A// Get ray in AABB's local space.\0D\0ARay GetRayInAABBPrimitiveLocalSpace()\0D\0A{\0D\0A    PrimitiveInstancePerFrameBuffer attr = g_AABBPrimitiveAttributes[l_aabbCB.instance_index];\0D\0A\0D\0A    // Retrieve a ray origin position and direction in bottom level AS space \0D\0A    // and transform them into the AABB primitive's local space.\0D\0A    Ray ray;\0D\0A    ray.origin = mul(float4(ObjectRayOrigin(), 1), attr.bottom_level_as_to_local_space).xyz;\0D\0A    ray.direction = mul(ObjectRayDirection(), (float3x3) attr.bottom_level_as_to_local_space);\0D\0A    return ray;\0D\0A}\0D\0A\0D\0A[shader(\22intersection\22)]\0D\0Avoid MyIntersectionShader_AnalyticPrimitive()\0D\0A{\0D\0A    Ray localRay = GetRayInAABBPrimitiveLocalSpace();\0D\0A    AnalyticPrimitive::Enum primitiveType = (AnalyticPrimitive::Enum) l_aabbCB.primitive_type;\0D\0A\0D\0A    float thit;\0D\0A    ProceduralPrimitiveAttributes attr = (ProceduralPrimitiveAttributes)0;\0D\0A    if (RayAnalyticGeometryIntersectionTest(localRay, primitiveType, thit, attr))\0D\0A    {\0D\0A        PrimitiveInstancePerFrameBuffer aabbAttribute = g_AABBPrimitiveAttributes[l_aabbCB.instance_index];\0D\0A        attr.normal = mul(attr.normal, (float3x3) aabbAttribute.local_space_to_bottom_level_as);\0D\0A        attr.normal = normalize(mul((float3x3) ObjectToWorld3x4(), attr.normal));\0D\0A\0D\0A        ReportHit(thit, /*hitKind*/ 0, attr);\0D\0A    }\0D\0A}\0D\0A\0D\0A[shader(\22intersection\22)]\0D\0Avoid MyIntersectionShader_VolumetricPrimitive()\0D\0A{\0D\0A    Ray localRay = GetRayInAABBPrimitiveLocalSpace();\0D\0A    VolumetricPrimitive::Enum primitiveType = (VolumetricPrimitive::Enum) l_aabbCB.primitive_type;\0D\0A\0D\0A    float thit;\0D\0A    ProceduralPrimitiveAttributes attr = (ProceduralPrimitiveAttributes)0;\0D\0A    if (RayVolumetricGeometryIntersectionTest(localRay, primitiveType, thit, attr, g_sceneCB.elapsed_time))\0D\0A    {\0D\0A        PrimitiveInstancePerFrameBuffer aabbAttribute = g_AABBPrimitiveAttributes[l_aabbCB.instance_index];\0D\0A        attr.normal = mul(attr.normal, (float3x3) aabbAttribute.local_space_to_bottom_level_as);\0D\0A        attr.normal = normalize(mul((float3x3) ObjectToWorld3x4(), attr.normal));\0D\0A\0D\0A        ReportHit(thit, /*hitKind*/ 0, attr);\0D\0A    }\0D\0A}\0D\0A\0D\0A[shader(\22intersection\22)]\0D\0Avoid MyIntersectionShader_SignedDistancePrimitive()\0D\0A{\0D\0A    Ray localRay = GetRayInAABBPrimitiveLocalSpace();\0D\0A    SignedDistancePrimitive::Enum primitiveType = (SignedDistancePrimitive::Enum) l_aabbCB.primitive_type;\0D\0A\0D\0A    float thit;\0D\0A    ProceduralPrimitiveAttributes attr = (ProceduralPrimitiveAttributes)0;\0D\0A    if (RaySignedDistancePrimitiveTest(localRay, primitiveType, thit, attr, l_materialCB.step_scale))\0D\0A    {\0D\0A        PrimitiveInstancePerFrameBuffer aabbAttribute = g_AABBPrimitiveAttributes[l_aabbCB.instance_index];\0D\0A        attr.normal = mul(attr.normal, (float3x3) aabbAttribute.local_space_to_bottom_level_as);\0D\0A        attr.normal = normalize(mul((float3x3) ObjectToWorld3x4(), attr.normal));\0D\0A\0D\0A        ReportHit(thit, /*hitKind*/ 0, attr);\0D\0A    }\0D\0A}\0D\0A\0D\0A#endif // RAYTRACING_HLSL\0D\0A"}
!464 = !{!"E:\5CProjects\5CDX12ImGuiExample\5Csrc\5CAnalyticPrimitives.hlsli", !"//*********************************************************\0A//\0A// Copyright (c) Microsoft. All rights reserved.\0A// This code is licensed under the MIT License (MIT).\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0A//\0A//*********************************************************\0A\0A//**********************************************************************************************\0A//\0A// AnalyticPrimitives.hlsli\0A//\0A// Set of ray vs analytic primitive intersection tests.\0A//\0A//**********************************************************************************************\0A\0A#ifndef ANALYTICPRIMITIVES_H\0A#define ANALYTICPRIMITIVES_H\0A\0A\0A#include \22RaytracingShaderHelper.hlsli\22\0A\0A// Solve a quadratic equation.\0A// Ref: https://www.scratchapixel.com/lessons/3d-basic-rendering/minimal-ray-tracer-rendering-simple-shapes/ray-sphere-intersection\0Abool SolveQuadraticEqn(float a, float b, float c, inout float x0, inout float x1)\0A{\0A    float discr = b * b - 4 * a * c;\0A    if (discr < 0) return false;\0A    else if (discr == 0) x0 = x1 = -0.5 * b / a;\0A    else {\0A        float q = (b > 0) ?\0A            -0.5 * (b + sqrt(discr)) :\0A            -0.5 * (b - sqrt(discr));\0A        x0 = q / a;\0A        x1 = c / q;\0A    }\0A    if (x0 > x1) swap(x0, x1);\0A\0A    return true;\0A}\0A\0A// Calculate a normal for a hit point on a sphere.\0Afloat3 CalculateNormalForARaySphereHit(in Ray ray, in float thit, float3 center)\0A{\0A    float3 hitPosition = ray.origin + thit * ray.direction;\0A    return normalize(hitPosition - center);\0A}\0A\0A// Analytic solution of an unbounded ray sphere intersection points.\0A// Ref: https://www.scratchapixel.com/lessons/3d-basic-rendering/minimal-ray-tracer-rendering-simple-shapes/ray-sphere-intersection\0Abool SolveRaySphereIntersectionEquation(in Ray ray, inout float tmin, inout float tmax, in float3 center, in float radius)\0A{\0A    float3 L = ray.origin - center;\0A    float a = dot(ray.direction, ray.direction);\0A    float b = 2 * dot(ray.direction, L);\0A    float c = dot(L, L) - radius * radius;\0A    return SolveQuadraticEqn(a, b, c, tmin, tmax);\0A}\0A\0A// Test if a ray with RayFlags and segment <RayTMin(), RayTCurrent()> intersects a hollow sphere.\0Abool RaySphereIntersectionTest(in Ray ray, inout float thit, inout float tmax, out ProceduralPrimitiveAttributes attr, in float3 center = float3(0, 0, 0), in float radius = 1)\0A{\0A    float t0, t1; // solutions for t if the ray intersects \0A\0A    if (!SolveRaySphereIntersectionEquation(ray, t0, t1, center, radius)) return false;\0A    tmax = t1;\0A\0A    if (t0 < RayTMin())\0A    {\0A        // t0 is before RayTMin, let's use t1 instead .\0A        if (t1 < RayTMin()) return false; // both t0 and t1 are before RayTMin\0A\0A        attr.normal = CalculateNormalForARaySphereHit(ray, t1, center);\0A        if (IsAValidHit(ray, t1, attr.normal))\0A        {\0A            thit = t1;\0A            return true;\0A        }\0A    }\0A    else\0A    {\0A        attr.normal = CalculateNormalForARaySphereHit(ray, t0, center);\0A        if (IsAValidHit(ray, t0, attr.normal))\0A        {\0A            thit = t0;\0A            return true;\0A        }\0A\0A        attr.normal = CalculateNormalForARaySphereHit(ray, t1, center);\0A        if (IsAValidHit(ray, t1, attr.normal))\0A        {\0A            thit = t1;\0A            return true;\0A        }\0A    }\0A    return false;\0A}\0A\0A// Test if a ray segment <RayTMin(), RayTCurrent()> intersects a solid sphere.\0A// Limitation: this test does not take RayFlags into consideration and does not calculate a surface normal.\0Abool RaySolidSphereIntersectionTest(in Ray ray, inout float thit, inout float tmax, in float3 center = float3(0, 0, 0), in float radius = 1)\0A{\0A    float t0, t1; // solutions for t if the ray intersects \0A\0A    if (!SolveRaySphereIntersectionEquation(ray, t0, t1, center, radius)) \0A        return false;\0A\0A    // Since it's a solid sphere, clip intersection points to ray extents.\0A    thit = max(t0, RayTMin());\0A    tmax = min(t1, RayTCurrent());\0A\0A    return true;\0A}\0A\0A// Test if a ray with RayFlags and segment <RayTMin(), RayTCurrent()> intersects multiple hollow spheres.\0Abool RaySpheresIntersectionTest(in Ray ray, out float thit, out ProceduralPrimitiveAttributes attr)\0A{\0A    const int N = 3;\0A    float3 centers[N] =\0A    {\0A        float3(-0.3, -0.3, -0.3),\0A        float3(0.1, 0.1, 0.4),\0A        float3(0.35,0.35, 0.0)\0A    };\0A    float  radii[N] = { 0.6, 0.3, 0.15 };\0A    bool hitFound = false;\0A\0A    //\0A    // Test for intersection against all spheres and take the closest hit.\0A    //\0A    thit = RayTCurrent();\0A\0A    // test against all spheres\0A    for (int i = 0; i < N; i++)\0A    {\0A        float _thit;\0A        float _tmax;\0A        ProceduralPrimitiveAttributes _attr = (ProceduralPrimitiveAttributes)0;\0A        if (RaySphereIntersectionTest(ray, _thit, _tmax, _attr, centers[i], radii[i]))\0A        {\0A            if (_thit < thit)\0A            {\0A                thit = _thit;\0A                attr = _attr;\0A                hitFound = true;\0A            }\0A        }\0A    }\0A    return hitFound;\0A}\0A\0A// Test if a ray segment <RayTMin(), RayTCurrent()> intersects an AABB.\0A// Limitation: this test does not take RayFlags into consideration and does not calculate a surface normal.\0A// Ref: https://www.scratchapixel.com/lessons/3d-basic-rendering/minimal-ray-tracer-rendering-simple-shapes/ray-box-intersection\0Abool RayAABBIntersectionTest(Ray ray, float3 aabb[2], out float tmin, out float tmax)\0A{\0A    float3 tmin3, tmax3;\0A    int3 sign3 = ray.direction > 0;\0A\0A    // Handle rays parallel to any x|y|z slabs of the AABB.\0A    // If a ray is within the parallel slabs, \0A    //  the tmin, tmax will get set to -inf and +inf\0A    //  which will get ignored on tmin/tmax = max/min.\0A    // If a ray is outside the parallel slabs, -inf/+inf will\0A    //  make tmax > tmin fail (i.e. no intersection).\0A    // TODO: handle cases where ray origin is within a slab \0A    //  that a ray direction is parallel to. In that case\0A    //  0 * INF => NaN\0A    const float FLT_INFINITY = 1.#INF;\0A    float3 invRayDirection = select(ray.direction != 0, 1 / ray.direction, select(ray.direction > 0, FLT_INFINITY, -FLT_INFINITY));\0A\0A    tmin3.x = (aabb[1 - sign3.x].x - ray.origin.x) * invRayDirection.x;\0A    tmax3.x = (aabb[sign3.x].x - ray.origin.x) * invRayDirection.x;\0A\0A    tmin3.y = (aabb[1 - sign3.y].y - ray.origin.y) * invRayDirection.y;\0A    tmax3.y = (aabb[sign3.y].y - ray.origin.y) * invRayDirection.y;\0A    \0A    tmin3.z = (aabb[1 - sign3.z].z - ray.origin.z) * invRayDirection.z;\0A    tmax3.z = (aabb[sign3.z].z - ray.origin.z) * invRayDirection.z;\0A    \0A    tmin = max(max(tmin3.x, tmin3.y), tmin3.z);\0A    tmax = min(min(tmax3.x, tmax3.y), tmax3.z);\0A    \0A    return tmax > tmin && tmax >= RayTMin() && tmin <= RayTCurrent();\0A}\0A\0A// Test if a ray with RayFlags and segment <RayTMin(), RayTCurrent()> intersects a hollow AABB.\0Abool RayAABBIntersectionTest(Ray ray, float3 aabb[2], inout float thit, inout ProceduralPrimitiveAttributes attr)\0A{\0A    float tmin, tmax;\0A    if (RayAABBIntersectionTest(ray, aabb, tmin, tmax))\0A    {\0A        // Only consider intersections crossing the surface from the outside.\0A        if (tmin < RayTMin() || tmin > RayTCurrent())\0A            return false;\0A\0A        thit = tmin;\0A\0A        // Set a normal to the normal of a face the hit point lays on.\0A        float3 hitPosition = ray.origin + thit * ray.direction;\0A        float3 distanceToBounds[2] = {\0A            abs(aabb[0] - hitPosition),\0A            abs(aabb[1] - hitPosition)\0A        };\0A        const float eps = 0.0001;\0A        if (distanceToBounds[0].x < eps) attr.normal = float3(-1, 0, 0);\0A        else if (distanceToBounds[0].y < eps) attr.normal = float3(0, -1, 0);\0A        else if (distanceToBounds[0].z < eps) attr.normal = float3(0, 0, -1);\0A        else if (distanceToBounds[1].x < eps) attr.normal = float3(1, 0, 0);\0A        else if (distanceToBounds[1].y < eps) attr.normal = float3(0, 1, 0);\0A        else if (distanceToBounds[1].z < eps) attr.normal = float3(0, 0, 1);\0A\0A        return IsAValidHit(ray, thit, attr.normal);\0A    }\0A    return false;\0A}\0A\0A#endif // ANALYTICPRIMITIVES_H"}
!465 = !{!"E:\5CProjects\5CDX12ImGuiExample\5Csrc\5CConstantBuffers.h", !"#ifndef CONSTANT_BUFFERS_H\0D\0A#define CONSTANT_BUFFERS_H\0D\0A\0D\0A#ifdef HLSL\0D\0A#include \22HlslCompat.h\22\0D\0A#else\0D\0A#include <DirectXMath.h>\0D\0Ausing namespace DirectX;\0D\0A#endif\0D\0A\0D\0A// Number of metaballs to use within an AABB.\0D\0A#define METABALLS_COUNT 3\0D\0A\0D\0A// Limitting calculations only to metaballs a ray intersects can speed up raytracing\0D\0A// dramatically particularly when there is a higher number of metaballs used.\0D\0A// Use of dynamic loops can have detrimental effects to performance for low iteration counts\0D\0A// and outweighing any potential gains from avoiding redundant calculations.\0D\0A// Requires: USE_DYNAMIC_LOOPS set to 1 to take effect.\0D\0A#if METABALLS_COUNT >= 5\0D\0A#define USE_DYNAMIC_LOOPS 1\0D\0A#define LIMIT_TO_ACTIVE_METABALLS 1\0D\0A#else\0D\0A#define USE_DYNAMIC_LOOPS 0\0D\0A#define LIMIT_TO_ACTIVE_METABALLS 0\0D\0A#endif\0D\0A\0D\0A#define FRACTAL_ITERATIONS_COUNT 4\0D\0A\0D\0A// NOTE: Set max recursion depth as low as needed\0D\0A// as drivers may apply optimization strategies for low recursion depths.\0D\0A#define MAX_RAY_RECURSION_DEPTH 3 // ~ primary rays + reflections + shadow rays from reflected geometry.\0D\0A\0D\0Astruct ProceduralPrimitiveAttributes\0D\0A{\0D\0A    XMFLOAT3 normal;\0D\0A};\0D\0A\0D\0Astruct RayPayload\0D\0A{\0D\0A    XMFLOAT4 color;\0D\0A    UINT recursion_depth;\0D\0A};\0D\0A\0D\0Astruct ShadowRayPayload\0D\0A{\0D\0A    bool hit;\0D\0A};\0D\0A\0D\0Astruct SceneConstantBuffer\0D\0A{\0D\0A    XMMATRIX projection_to_world;\0D\0A    XMVECTOR camera_position;\0D\0A    XMVECTOR light_position;\0D\0A    XMVECTOR light_ambient_color;\0D\0A    XMVECTOR light_diffuse_color;\0D\0A    float reflectance;\0D\0A    float elapsed_time;\0D\0A};\0D\0A\0D\0A// Attributes per primitive type.\0D\0Astruct PrimitiveConstantBuffer\0D\0A{\0D\0A    XMFLOAT4 albedo;\0D\0A    float reflectance_coefficient;\0D\0A    float diffuse_coefficient;\0D\0A    float specular_coefficient;\0D\0A    float specular_power;\0D\0A    float step_scale; // Step scale for ray marching of signed distance primitives.\0D\0A        // - Some object transformations don't preserve the distances and thus require shorter steps.\0D\0A    XMFLOAT3 padding;\0D\0A};\0D\0A\0D\0A// Attributes per primitive instance.\0D\0Astruct PrimitiveInstanceConstantBuffer\0D\0A{\0D\0A    UINT instance_index;\0D\0A    UINT primitive_type; // Procedural primitive type\0D\0A};\0D\0A\0D\0A// Dynamic attributes per primitive instance.\0D\0Astruct PrimitiveInstancePerFrameBuffer\0D\0A{\0D\0A    XMMATRIX local_space_to_bottom_level_as; // Matrix from local primitive space to bottom-level object space.\0D\0A    XMMATRIX bottom_level_as_to_local_space; // Matrix from bottom-level object space to local primitive space.\0D\0A};\0D\0A\0D\0Astruct Vertex\0D\0A{\0D\0A    XMFLOAT3 position;\0D\0A    XMFLOAT3 normal;\0D\0A};\0D\0A\0D\0A// Ray types traced in this sample.\0D\0Anamespace RayType\0D\0A{\0D\0A\0D\0Aenum Enum\0D\0A{\0D\0A    Radiance = 0, // ~ Primary, reflected camera/view rays calculating color for each hit.\0D\0A    Shadow, // ~ Shadow/visibility rays, only testing for occlusion\0D\0A    Count\0D\0A};\0D\0A\0D\0A}\0D\0A\0D\0Anamespace TraceRayParameters\0D\0A{\0D\0Astatic const UINT INSTANCE_MASK = ~0; // Everything is visible.\0D\0A\0D\0Anamespace HitGroup\0D\0A{\0D\0A\0D\0Astatic const UINT OFFSET[RayType::Count] = {\0D\0A    0, // Radiance ray\0D\0A    1 // Shadow ray\0D\0A};\0D\0A\0D\0Astatic const UINT GEOMETRY_STRIDE = RayType::Count;\0D\0A\0D\0A}\0D\0A\0D\0Anamespace MissShader\0D\0A{\0D\0A\0D\0Astatic const UINT OFFSET[RayType::Count] = {\0D\0A    0, // Radiance ray\0D\0A    1 // Shadow ray\0D\0A};\0D\0A\0D\0A}\0D\0A\0D\0A}\0D\0A\0D\0A// From: http://blog.selfshadow.com/publications/s2015-shading-course/hoffman/s2015_pbs_physics_math_slides.pdf\0D\0Astatic const XMFLOAT4 CHROMIUM_REFLECTANCE = XMFLOAT4(0.549f, 0.556f, 0.554f, 1.0f);\0D\0A\0D\0Astatic const XMFLOAT4 BACKGROUND_COLOR = XMFLOAT4(0.8f, 0.9f, 1.0f, 1.0f);\0D\0Astatic float const IN_SHADOW_RADIANCE = 0.35f;\0D\0A\0D\0Anamespace AnalyticPrimitive\0D\0A{\0D\0A\0D\0Aenum Enum\0D\0A{\0D\0A    AABB = 0,\0D\0A    Spheres,\0D\0A    Count\0D\0A};\0D\0A\0D\0A}\0D\0A\0D\0Anamespace VolumetricPrimitive\0D\0A{\0D\0A\0D\0Aenum Enum\0D\0A{\0D\0A    Metaballs = 0,\0D\0A    Count\0D\0A};\0D\0A\0D\0A}\0D\0A\0D\0Anamespace SignedDistancePrimitive\0D\0A{\0D\0A\0D\0Aenum Enum\0D\0A{\0D\0A    MiniSpheres = 0,\0D\0A    IntersectedRoundCube,\0D\0A    SquareTorus,\0D\0A    TwistedTorus,\0D\0A    Cog,\0D\0A    Cylinder,\0D\0A    FractalPyramid,\0D\0A    Count\0D\0A};\0D\0A\0D\0A}\0D\0A\0D\0A#endif\0D\0A"}
!466 = !{!"E:\5CProjects\5CDX12ImGuiExample\5Csrc\5CHlslCompat.h", !"#ifndef HLSLCOMPAT_H\0D\0A#define HLSLCOMPAT_H\0D\0A\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A\0D\0A#endif // HLSLCOMPAT_H\0D\0A"}
!467 = !{!"E:\5CProjects\5CDX12ImGuiExample\5Csrc\5CProceduralPrimitivesLibrary.hlsli", !"//*********************************************************\0A//\0A// Copyright (c) Microsoft. All rights reserved.\0A// This code is licensed under the MIT License (MIT).\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0A//\0A//*********************************************************\0A\0A//**********************************************************************************************\0A//\0A// ProceduralPrimitivesLibrary.hlsli\0A//\0A// An interface to call per geometry intersection tests based on as primitive type.\0A//\0A//**********************************************************************************************\0A\0A#ifndef PROCEDURALPRIMITIVESLIBRARY_H\0A#define PROCEDURALPRIMITIVESLIBRARY_H\0A\0A#include \22RaytracingShaderHelper.hlsli\22\0A\0A#include \22AnalyticPrimitives.hlsli\22\0A#include \22VolumetricPrimitives.hlsli\22\0A#include \22SignedDistancePrimitives.hlsli\22\0A#include \22SignedDistanceFractals.hlsli\22\0A\0A// Analytic geometry intersection test.\0A// AABB local space dimensions: <-1,1>.\0Abool RayAnalyticGeometryIntersectionTest(in Ray ray, in AnalyticPrimitive::Enum analyticPrimitive, inout float thit, inout ProceduralPrimitiveAttributes attr)\0A{\0A    float3 aabb[2] = {\0A        float3(-1,-1,-1),\0A        float3(1,1,1)\0A    };\0A    float tmax;\0A\0A    switch (analyticPrimitive)\0A    {\0A    case AnalyticPrimitive::AABB: return RayAABBIntersectionTest(ray, aabb, thit, attr);\0A    case AnalyticPrimitive::Spheres: return RaySpheresIntersectionTest(ray, thit, attr);\0A    default: return false;\0A    }\0A}\0A\0A// Analytic geometry intersection test.\0A// AABB local space dimensions: <-1,1>.\0Abool RayVolumetricGeometryIntersectionTest(in Ray ray, in VolumetricPrimitive::Enum volumetricPrimitive, inout float thit, inout ProceduralPrimitiveAttributes attr, in float elapsedTime)\0A{\0A    switch (volumetricPrimitive)\0A    {\0A    case VolumetricPrimitive::Metaballs: return RayMetaballsIntersectionTest(ray, thit, attr, elapsedTime);\0A    default: return false;\0A    }\0A}\0A\0A// Signed distance functions use a shared ray signed distance test.\0A// The test, instead, calls into this function to retrieve a distance for a primitive.\0A// AABB local space dimensions: <-1,1>.\0A// Ref: http://www.iquilezles.org/www/articles/distfunctions/distfunctions.htm\0Afloat GetDistanceFromSignedDistancePrimitive(in float3 position, in SignedDistancePrimitive::Enum signedDistancePrimitive)\0A{\0A    switch (signedDistancePrimitive)\0A    {\0A    case SignedDistancePrimitive::MiniSpheres:\0A        return opI(sdSphere(opRep(position + 1, (float3) 2/4), 0.65 / 4), sdBox(position, (float3)1));\0A\0A    case SignedDistancePrimitive::IntersectedRoundCube:\0A        return opS(opS(udRoundBox(position, (float3) 0.75, 0.2), sdSphere(position, 1.20)), -sdSphere(position, 1.32));\0A\0A    case SignedDistancePrimitive::SquareTorus: \0A        return sdTorus82(position, float2(0.75, 0.15));\0A    \0A    case SignedDistancePrimitive::TwistedTorus: \0A        return sdTorus(opTwist(position), float2(0.6, 0.2));\0A        \0A    case SignedDistancePrimitive::Cog:\0A        return opS( sdTorus82(position, float2(0.60, 0.3)),\0A                    sdCylinder(opRep(float3(atan2(position.z, position.x) / 6.2831, \0A                                            1, \0A                                            0.015 + 0.25 * length(position)) + 1,\0A                                     float3(0.05, 1, 0.075)),\0A                               float2(0.02, 0.8)));\0A    \0A    case SignedDistancePrimitive::Cylinder: \0A        return opI(sdCylinder(opRep(position + float3(1, 1, 1), float3(1, 2, 1)), float2(0.3, 2)),\0A                   sdBox(position + float3(1, 1, 1), float3(2, 2, 2)));\0A    \0A    case SignedDistancePrimitive::FractalPyramid: \0A         // Let pyramid have a base at y == -1 of AABB => position + float3(0,1,0) \0A         // Pyramid: 63.435 degrees at base, height 2\0A         return sdFractalPyramid(position + float3(0, 1, 0), float3(0.894, 0.447, 2.0), 2.0f);\0A    \0A    default: return 0;\0A    }\0A}\0A\0A#endif // PROCEDURALPRIMITIVESLIBRARY_H"}
!468 = !{!"E:\5CProjects\5CDX12ImGuiExample\5Csrc\5CRaytracingShaderHelper.hlsli", !"//*********************************************************\0A//\0A// Copyright (c) Microsoft. All rights reserved.\0A// This code is licensed under the MIT License (MIT).\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0A//\0A//*********************************************************\0A\0A#ifndef RAYTRACINGSHADERHELPER_H\0A#define RAYTRACINGSHADERHELPER_H\0A\0A#include \22ConstantBuffers.h\22\0A\0A#define INFINITY (1.0/0.0)\0A\0Astruct Ray\0A{\0A    float3 origin;\0A    float3 direction;\0A};\0A\0Afloat length_toPow2(float2 p)\0A{\0A    return dot(p, p);\0A}\0A\0Afloat length_toPow2(float3 p)\0A{\0A    return dot(p, p);\0A}\0A\0A// Returns a cycling <0 -> 1 -> 0> animation interpolant \0Afloat CalculateAnimationInterpolant(in float elapsedTime, in float cycleDuration)\0A{\0A    float curLinearCycleTime = fmod(elapsedTime, cycleDuration) / cycleDuration;\0A    curLinearCycleTime = (curLinearCycleTime <= 0.5f) ? 2 * curLinearCycleTime : 1 - 2 * (curLinearCycleTime - 0.5f);\0A    return smoothstep(0, 1, curLinearCycleTime);\0A}\0A\0Avoid swap(inout float a, inout float b)\0A{\0A    float temp = a;\0A    a = b;\0A    b = temp;\0A}\0A\0Abool IsInRange(in float val, in float min, in float max)\0A{\0A    return (val >= min && val <= max);\0A}\0A\0A// Load three 16 bit indices.\0Astatic\0Auint3 Load3x16BitIndices(uint offsetBytes, ByteAddressBuffer Indices)\0A{\0A    uint3 indices;\0A\0A    // ByteAdressBuffer loads must be aligned at a 4 byte boundary.\0A    // Since we need to read three 16 bit indices: { 0, 1, 2 } \0A    // aligned at a 4 byte boundary as: { 0 1 } { 2 0 } { 1 2 } { 0 1 } ...\0A    // we will load 8 bytes (~ 4 indices { a b | c d }) to handle two possible index triplet layouts,\0A    // based on first index's offsetBytes being aligned at the 4 byte boundary or not:\0A    //  Aligned:     { 0 1 | 2 - }\0A    //  Not aligned: { - 0 | 1 2 }\0A    const uint dwordAlignedOffset = offsetBytes & ~3;\0A    const uint2 four16BitIndices = Indices.Load2(dwordAlignedOffset);\0A\0A    // Aligned: { 0 1 | 2 - } => retrieve first three 16bit indices\0A    if (dwordAlignedOffset == offsetBytes)\0A    {\0A        indices.x = four16BitIndices.x & 0xffff;\0A        indices.y = (four16BitIndices.x >> 16) & 0xffff;\0A        indices.z = four16BitIndices.y & 0xffff;\0A    }\0A    else // Not aligned: { - 0 | 1 2 } => retrieve last three 16bit indices\0A    {\0A        indices.x = (four16BitIndices.x >> 16) & 0xffff;\0A        indices.y = four16BitIndices.y & 0xffff;\0A        indices.z = (four16BitIndices.y >> 16) & 0xffff;\0A    }\0A\0A    return indices;\0A}\0A\0A// Retrieve hit world position.\0Afloat3 HitWorldPosition()\0A{\0A    return WorldRayOrigin() + RayTCurrent() * WorldRayDirection();\0A}\0A\0A// Retrieve attribute at a hit position interpolated from vertex attributes using the hit's barycentrics.\0Afloat3 HitAttribute(float3 vertexAttribute[3], float2 barycentrics)\0A{\0A    return vertexAttribute[0] +\0A        barycentrics.x * (vertexAttribute[1] - vertexAttribute[0]) +\0A        barycentrics.y * (vertexAttribute[2] - vertexAttribute[0]);\0A}\0A\0A// Generate a ray in world space for a camera pixel corresponding to an index from the dispatched 2D grid.\0Ainline Ray GenerateCameraRay(uint2 index, in float3 cameraPosition, in float4x4 projectionToWorld)\0A{\0A    float2 xy = index + 0.5f; // center in the middle of the pixel.\0A    float2 screenPos = xy / DispatchRaysDimensions().xy * 2.0 - 1.0;\0A\0A    // Invert Y for DirectX-style coordinates.\0A    screenPos.y = -screenPos.y;\0A\0A    // Unproject the pixel coordinate into a world positon.\0A    float4 world = mul(float4(screenPos, 0, 1), projectionToWorld);\0A    world.xyz /= world.w;\0A\0A    Ray ray;\0A    ray.origin = cameraPosition;\0A    ray.direction = normalize(world.xyz - ray.origin);\0A\0A    return ray;\0A}\0A\0A// Test if a hit is culled based on specified RayFlags.\0Abool IsCulled(in Ray ray, in float3 hitSurfaceNormal)\0A{\0A    float rayDirectionNormalDot = dot(ray.direction, hitSurfaceNormal);\0A\0A    bool isCulled = \0A        ((RayFlags() & RAY_FLAG_CULL_BACK_FACING_TRIANGLES) && (rayDirectionNormalDot > 0))\0A        ||\0A        ((RayFlags() & RAY_FLAG_CULL_FRONT_FACING_TRIANGLES) && (rayDirectionNormalDot < 0));\0A\0A    return isCulled; \0A}\0A\0A// Test if a hit is valid based on specified RayFlags and <RayTMin, RayTCurrent> range.\0Abool IsAValidHit(in Ray ray, in float thit, in float3 hitSurfaceNormal)\0A{\0A    return IsInRange(thit, RayTMin(), RayTCurrent()) && !IsCulled(ray, hitSurfaceNormal);\0A}\0A\0A// Texture coordinates on a horizontal plane.\0Afloat2 TexCoords(in float3 position)\0A{\0A    return position.xz;\0A}\0A\0A// Calculate ray differentials.\0Avoid CalculateRayDifferentials(out float2 ddx_uv, out float2 ddy_uv, in float2 uv, in float3 hitPosition, in float3 surfaceNormal, in float3 cameraPosition, in float4x4 projectionToWorld)\0A{\0A    // Compute ray differentials by intersecting the tangent plane to the  surface.\0A    Ray ddx = GenerateCameraRay(DispatchRaysIndex().xy + uint2(1, 0), cameraPosition, projectionToWorld);\0A    Ray ddy = GenerateCameraRay(DispatchRaysIndex().xy + uint2(0, 1), cameraPosition, projectionToWorld);\0A\0A    // Compute ray differentials.\0A    float3 ddx_pos = ddx.origin - ddx.direction * dot(ddx.origin - hitPosition, surfaceNormal) / dot(ddx.direction, surfaceNormal);\0A    float3 ddy_pos = ddy.origin - ddy.direction * dot(ddy.origin - hitPosition, surfaceNormal) / dot(ddy.direction, surfaceNormal);\0A\0A    // Calculate texture sampling footprint.\0A    ddx_uv = TexCoords(ddx_pos) - uv;\0A    ddy_uv = TexCoords(ddy_pos) - uv;\0A}\0A\0A// Forward declaration.\0Afloat CheckersTextureBoxFilter(in float2 uv, in float2 dpdx, in float2 dpdy, in UINT ratio);\0A\0A// Return analytically integrated checkerboard texture (box filter).\0Afloat AnalyticalCheckersTexture(in float3 hitPosition, in float3 surfaceNormal, in float3 cameraPosition, in float4x4 projectionToWorld)\0A{\0A    float2 ddx_uv;\0A    float2 ddy_uv;\0A    float2 uv = TexCoords(hitPosition);\0A\0A    CalculateRayDifferentials(ddx_uv, ddy_uv, uv, hitPosition, surfaceNormal, cameraPosition, projectionToWorld);\0A    return CheckersTextureBoxFilter(uv, ddx_uv, ddy_uv, 50);\0A}\0A\0A// Fresnel reflectance - schlick approximation.\0Afloat3 FresnelReflectanceSchlick(in float3 I, in float3 N, in float3 f0)\0A{\0A    float cosi = saturate(dot(-I, N));\0A    return f0 + (1 - f0)*pow(1 - cosi, 5);\0A}\0A\0A\0A#endif // RAYTRACINGSHADERHELPER_H"}
